---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OffsetfacesShowShapeHandles
source: html/bbfc1188-33e8-d8aa-6117-1d307c279569.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OffsetfacesShowShapeHandles Property

"Show Shape Handles"

## Syntax (C#)
```csharp
public static ForgeTypeId OffsetfacesShowShapeHandles { get; }
```